ignusius/STM32CubeIDE_SPL_STM32F100RB_Template/Src/main.c
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"


void initSystemClock(){
	RCC_DeInit(); //	сброс настроек тактового генератора
	RCC_HSICmd(DISABLE); //	выключение внутреннего RC HSI 8МГц генератора
	RCC_HSEConfig(RCC_HSE_ON); //	включение внешнего тактового генератора
	RCC_PREDIV1Config(RCC_PREDIV1_Source_HSE, RCC_PREDIV1_Div1);//	Предделитель PREDIV1: HSE перед множителем PLLMUL
	RCC_PLLConfig(RCC_PLLSource_PREDIV1 ,RCC_PLLMul_3); //	тактирование от HSE с PREDIV1 8/1*3 = 24МГц
	RCC_PLLCmd(ENABLE); //	Включаем PLL
	RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK); //	На системную шину подаем тактирование с множителя PLLMUL
}

int main(void) {

	initSystemClock();
	int i;
	GPIO_InitTypeDef GPIO_InitStructure;

	/* Initialize LED which connected to PC13 */
	// Enable PORTC Clock
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
	/* Configure the GPIO_LED pin */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	//GPIO_SetBits(GPIOC, GPIO_Pin_13); // Set C13 to High level ("1")
	GPIO_ResetBits(GPIOC, GPIO_Pin_13); // Set C13 to Low level ("0")

	/* Initialize Button input PB0 */
	// Enable PORTB Clock
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	/* Configure the GPIO_BUTTON pin */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	while (1) {

		GPIOC->ODR ^= GPIO_Pin_13; // Invert C13

		/* delay */
		for (i = 0; i < 0x100000; i++)
			;

		/* Toggle LED which connected to PC13*/
		GPIOC->ODR ^= GPIO_Pin_13;

		/* delay */
		for (i = 0; i < 0x100000; i++)
			;

	}
}
